content/workouts/2020-02-03-advanced-strength-format-squats.md
+++
title = "strength format change"
date = 2020-02-03T00:00:00-08:00
draft = false
+++

Advanced strength 0800

instead of doing the pyramid 10 reps down to 1. we've switched to "five by five"
so, five sets of five reps. I started with the most I had previously been using
in a pyramid, the 25kg kettlebell in the goblin hold. Moving up, I found the
single 75lb pretty easy to squat 5 times. The goal for the month was to be
building up endurance, which was not relevant to me, as I was just starting out
in my first month. Two dumbbells is pretty unwieldy to raise to shoulder level
and hold. I will have to switch to using the smith machine, or get help from
people to hand me one to each shoulder. I'm not sure the correspondence between
these types of squats and the leg press machine, but I do recall being able to
press the entire stack of weights on that machine.


## Warmup x3 {#warmup-x3}

Toe tap with bands alternating back and sides
Calf raise in,middle,out
Squat 24kg


## Workout 5x5 squat {#workout-5x5-squat}

Dumbbell limited
28kg (61lb)
65lb
75
90 (2x45)
100 (2x50)


## Cooldoen 40-15x4. 5 stations {#cooldoen-40-15x4-dot-5-stations}

Ball to arms pass and back
Atlas crunch. Feet up. Raise arms to toes with 5lb
Step up toe tap.
3x squat + 3x jump squat
Glute bridge hip addiction banded

urn:uuid:b4d9d262-f1e5-40ed-be03-e5f99da58d7e